#+BLOG: myblog
#+POSTID: 170
#+DATE: [2022-05-02 Mon 20:37]
#+TITLE: Java Thread
#+CATEGORY: Java
#+STARTUP: overview
** Callable 接口实现多线程
从最传统的开发来说，多线程的实现最多依靠的是 Runnable,但是 Runnable 接口在执行完毕之后，无法返回接口，于是 Callable 产生。(~java.util.concurrent~ 中，JDK1.5 之后)
~@FunctionalInterface public interface Callable<V>~ 可以设置一个泛型，该泛型的类型就是返回值的类型，Callable 只有一个方法 ~V call() throws Exception~ 。
1. Callable 没有 ~start()~ 方法，无法启动线程。
2. Callable 和 Thread 没有联系。
3. FutureTask (~java.util.concurrent~)
#+begin_src java
import java.util.concurrent.Callable;
import java.util.concurrent.FutureTask;
class Third implements Callable<String> {
    @Override
    public String call() throws Exception {
        for(int x=0;x<10;x++){
            System.out.println("**** 线程执行 x = " +  x);
        }
        return "线程执行完毕";
    }
}

public class Basic {
    public static void main(String[] args) throws Exception{
        FutureTask<String> task = new FutureTask<>(new Third());
        new Thread(task).start();
        System.out.println("线程返回数据" + task.get());
    }
}
#+end_src

#+RESULTS:
#+begin_example
,**** 线程执行 x = 0
,**** 线程执行 x = 1
,**** 线程执行 x = 2
,**** 线程执行 x = 3
,**** 线程执行 x = 4
,**** 线程执行 x = 5
,**** 线程执行 x = 6
,**** 线程执行 x = 7
,**** 线程执行 x = 8
,**** 线程执行 x = 9
线程返回数据线程执行完毕
#+end_example
